adafruit/circuitpython/ports/raspberrypi/boards/olimex_rp2350pc/mpconfigboard.h
// This file is part of the CircuitPython project: https://circuitpython.org
//
// SPDX-FileCopyrightText: Copyright (c) 2024 Scott Shawcroft for Adafruit Industries
//
// SPDX-License-Identifier: MIT

#define MICROPY_HW_BOARD_NAME "Olimex RP2350pc"
#define MICROPY_HW_MCU_NAME "rp2350b"

#define MICROPY_HW_LED_STATUS (&pin_GPIO25)

// Internal I2C bus (DVI, I2S), no user connection pins
#define DEFAULT_I2C_BUS_SCL (&pin_GPIO33)
#define DEFAULT_I2C_BUS_SDA (&pin_GPIO32)

#define DEFAULT_SPI_BUS_SCK (&pin_GPIO6)
#define DEFAULT_SPI_BUS_MOSI (&pin_GPIO7)
#define DEFAULT_SPI_BUS_MISO (&pin_GPIO4)

#define DEFAULT_UART_BUS_RX (&pin_GPIO1)
#define DEFAULT_UART_BUS_TX (&pin_GPIO0)

#define CIRCUITPY_CONSOLE_UART_RX DEFAULT_UART_BUS_RX
#define CIRCUITPY_CONSOLE_UART_TX DEFAULT_UART_BUS_TX

#define CIRCUITPY_PSRAM_CHIP_SELECT (&pin_GPIO8)

#define DEFAULT_DVI_BUS_CLK_DN (&pin_GPIO15)
#define DEFAULT_DVI_BUS_CLK_DP (&pin_GPIO14)
#define DEFAULT_DVI_BUS_RED_DN (&pin_GPIO13)
#define DEFAULT_DVI_BUS_RED_DP (&pin_GPIO12)
#define DEFAULT_DVI_BUS_GREEN_DN (&pin_GPIO19)
#define DEFAULT_DVI_BUS_GREEN_DP (&pin_GPIO18)
#define DEFAULT_DVI_BUS_BLUE_DN (&pin_GPIO17)
#define DEFAULT_DVI_BUS_BLUE_DP (&pin_GPIO16)

#define DEFAULT_SD_SCK (&pin_GPIO10)
#define DEFAULT_SD_MOSI (&pin_GPIO11)
#define DEFAULT_SD_MISO (&pin_GPIO24)
#define DEFAULT_SD_CS (&pin_GPIO9)
#define DEFAULT_SD_CARD_DETECT (&pin_GPIO41)
#define DEFAULT_SD_CARD_INSERTED true

#define CIRCUITPY_DEBUG_TINYUSB 1

// #define CIRCUITPY_SAVES_PARTITION_SIZE (2 * 1024 * 1024)
